//========================================
//
// クラス・ファイル分割[player.cpp]
// Author: Irisawa Kazan	
//
//========================================
#include"player.h"

//----------------------------
// コンストラクタ
//----------------------------
CPlayer::CPlayer()
{
	m_nLife = 0;
	m_nAttack = 0;
	m_nSpeed = 0;
}

//----------------------------
// デストラクタ
//----------------------------
CPlayer::~CPlayer()
{

}

//----------------------------
// 初期化処理
//----------------------------
void CPlayer::Init(void)
{
	m_nLife = 0;
	m_nAttack = 0;
	m_nSpeed = 0;
}

//----------------------------
// 終了処理
//----------------------------
void CPlayer::Uninit(void)
{

}

//----------------------------
// 入力処理
//----------------------------
void CPlayer::Input(void)
{
	printf("プレイヤーの体力を入力 > ");
	scanf("%d", &m_nLife);
	printf("プレイヤーの攻撃力を入力 > ");
	scanf("%d", &m_nAttack);
	printf("プレイヤーの素早さを入力 > ");
	scanf("%d", &m_nSpeed);

	printf("\n");
}

//----------------------------
// 出力処理
//----------------------------
void CPlayer::Output(void)
{
	printf("プレイヤーの体力: %d\n", m_nLife);
	printf("プレイヤーの攻撃力: %d\n", m_nAttack);
	printf("プレイヤーの素早さ: %d\n", m_nSpeed);

	printf("\n");
}